[Focuscast X2AbilityTemplate]  
+LocFriendlyName="精神聚焦协议"  
+LocLongDescription="为聚焦充能，造成一定量的伤害。"  
+LocHelpText="为聚焦充能，造成一定量的伤害。"  
+LocFlyOverText="精神聚焦协议"  
  
  
[MecGauntletSet X2AbilityTemplate]  
LocFriendlyName="灵能MEC"  
LocLongDescription="尽管此士兵已被改造成MEC步兵，但仍能像圣殿武士和灵能操控者一样使用灵能。"  
LocHelpText="尽管此士兵已被改造成MEC步兵，但仍能像圣殿武士和灵能操控者一样使用灵能。"  
LocPromotionPopupText="<Bullet/> 身心合一的灵能MEC步兵擅长前线、强力打击的角色<br/><Bullet/> 使用刀刃击杀敌人可获得集中。<br/><Bullet/> 1级集中：刀刃伤害 +<Ability:FOCUS1RENDDAMAGE/>，移动力 +<Ability:FOCUS1MOBILITY/>，闪避 +<Ability:FOCUS1DODGE/><br/><Bullet/> 2级集中：刀刃伤害 +<Ability:FOCUS2RENDDAMAGE/>，移动力 +<Ability:FOCUS2MOBILITY/>，闪避 +<Ability:FOCUS2DODGE/><br/><Bullet/> 3级集中：刀刃伤害 +<Ability:FOCUS3RENDDAMAGE/>，移动力 +<Ability:FOCUS3MOBILITY/>，闪避 +<Ability:FOCUS3DODGE/><br/>"  
  
[CasterGauntletFire X2AbilityTemplate]  
LocFriendlyName="光环重击"  
LocLongDescription="用你的护手重击远处的敌人。"  
LocHelpText="用你的护手重击远处的敌人。"  
  
  
[PsychicStrike X2AbilityTemplate]  
LocFriendlyName="灵能打击"  
LocLongDescription="使用你的灵能MEC拳头攻击范围内的任何敌人。触发动量。"  
LocHelpText="使用你的PsiMEC拳头攻击范围内的敌人。触发动量。"  
LocPromotionPopupText="<Bullet/> 尽管它缺乏XCOM其他近战攻击的范围，但动能打击通过更大的伤害和消耗一个行动点而不结束回合来弥补这一点。<br/>"  
  
  
[MecFocus X2AbilityTemplate]  
LocFriendlyName="焦点操作系统"  
LocLongDescription="通过精神聚焦协议在任务中获得集中，可用于强大的灵能能力。"  
LocHelpText="通过精神聚焦协议在任务中获得集中，可用于强大的灵能能力。"  
LocPromotionPopupText="<Bullet/> 灵能MEC步兵在任务开始时比其他机械单位弱，但在更高的集中等级下会变得极其强大。有效地管理集中以充分利用状态提升和每个能力是使用灵能MEC步兵的关键。<br/><Bullet/> 通过使用刀刃击杀敌人获得集中。<br/><Bullet/> 集中等级1：刀刃伤害 +1，移动力 +1，闪避 +10<br/><Bullet/> 集中等级2：刀刃伤害 +2，移动力 +2，闪避 +20<br/><Bullet/> 集中等级3：刀刃伤害 +3，移动力 +3，闪避 +25<br/>"  
  
[MecWavePassive X2AbilityTemplate]  
LocFriendlyName="灵能突袭"  
LocLongDescription="就像原始圣殿武士一样，圣殿MEC步兵也通过电弧波刀刃拥有强大的近战能力。"  
LocHelpText="就像原始圣殿武士一样，圣殿MEC步兵也通过电弧波刀刃拥有强大的近战能力。"  
LocPromotionPopupText="<Bullet/> 就像原始圣殿武士一样，圣殿MEC步兵也通过电弧波刀刃和动量拥有强大的近战能力。<br/><Bullet/> 电弧波造成的伤害等于圣殿武士当前集中等级的两倍，如果没有集中则为1。<br/><Bullet/> 电弧波可以穿过环境物体。<br/>"  
  
[MecWave X2AbilityTemplate]  
+LocFriendlyName="刀刃"  
+LocLongDescription="近战攻击，有机会击晕或使目标迷失方向。不会落空。触发动量。"  
+LocHelpText="近战攻击，有机会击晕或使目标迷失方向。触发动量。"  
  
[MakeMomentum X2AbilityTemplate]  
LocFriendlyName="动量协议"  
LocLongDescription="灵能MEC步兵可以通过消耗集中来随时激活动量。"  
LocHelpText="灵能MEC步兵可以通过消耗集中来随时激活动量。"  
LocFlyOverText="动量协议"  
LocPromotionPopupText="灵能MEC步兵可以（测试）"  
  
[MecStasis X2AbilityTemplate]  
LocFriendlyName="静止协议"  
LocLongDescription="完全击晕目标一回合，但使其免受任何伤害或攻击。（集中：1）"  
LocHelpText="完全击晕目标一回合，但使其免受任何伤害或攻击。（集中：1）"  
LocFlyOverText="静止协议"  
LocPromotionPopupText="<Bullet/> 静止有集中成本<br/><Bullet/> 由于静止完全使敌人单位在一回合内无法战斗，它可以用来防御性地保护脆弱的士兵，也可以用来进攻性地设置协调攻击。<br/>"  
  
[MecPsiReanimation X2AbilityTemplate]  
LocFriendlyName="复活协议"  
LocLongDescription="灵能MEC步兵可以用灵能能量淹没最近死亡的人形生物的神经系统，使它们像傀儡一样在其控制下移动和战斗，成为'灵能僵尸'。"  
LocHelpText="复活一名死亡的士兵、平民或ADVENT士兵作为灵能僵尸。"  
LocFlyOverText="灵能复活"  
LocPromotionPopupText="<Bullet/> 灵能复活有集中成本<br/><Bullet/> 如果灵能MEC步兵被摧毁或离开战场，灵能复活将中断。<br/>"  
  
[Psi_SelfDefenceProtocol X2AbilityTemplate]  
LocFriendlyName="刀刃风暴协议"  
LocLongDescription="任何进入或从近战范围攻击的敌人都会受到必定命中的灵能打击攻击。（集中：1）"  
LocHelpText="任何进入或从近战范围攻击的敌人都会受到必定命中的灵能打击攻击。（集中：1）"  
LocFlyOverText="刀刃风暴"  
LocPromotionPopupText="<Bullet/> 如果敌人在回合开始时处于相邻格子，当该敌人尝试攻击<Ability:ClassName/>时，刀刃风暴将被触发。<br/><Bullet/> 如果敌人不在回合开始时处于相邻格子，则当该敌人进入近战范围时，刀刃风暴将被触发。<br/>"  
  
[PSiSDPATtack X2AbilityTemplate]  
LocFriendlyName="刀刃风暴协议"  
LocLongDescription="任何进入或从近战范围攻击的敌人都会受到必定命中的灵能打击攻击。（集中：1）"  
LocHelpText="任何进入或从近战范围攻击的敌人都会受到必定命中的灵能打击攻击。（集中：1）"  
LocFlyOverText="刀刃风暴协议"  
LocPromotionPopupText="<Bullet/> 如果敌人在回合开始时处于相邻格子，当该敌人尝试攻击<Ability:ClassName/>时，刀刃风暴将被触发。<br/><Bullet/> 如果敌人不在回合开始时处于相邻格子，则当该敌人进入近战范围时，刀刃风暴将被触发。<br/>"  
  
  
[MecTeleport X2AbilityTemplate]  
LocFriendlyName="传送协议"  
LocLongDescription="灵能MEC步兵可以传送到远处位置，而不是直接移动。绕过所有警戒和反击火力。"  
LocHelpText="传送到新位置。绕过所有警戒和反击火力。"  
LocFlyOverText="传送"

[MecPsiMindControl X2AbilityTemplate]
LocFriendlyName="心灵控制协议"
LocLongDescription="灵能机械突击兵可以主动控制目标的心灵，迫使他们攻击同伴。(专注：1)"
LocHelpText="主动控制目标的心灵（专注：1）"
LocFlyOverText="心灵控制协议"
LocPromotionPopupText="<Bullet/> 心灵控制需要灵能机械突击兵的灵能强度与目标意志力的较量。<br/><Bullet/> 如果灵能机械突击兵被摧毁或离开战场，心灵控制将被打破。<br/>"

[MecHolyWarrior X2AbilityTemplate]
LocFriendlyName="神圣战士"
LocLongDescription="此灵能机械突击兵与另一单位进行心灵融合。融合存在期间，该单位获得属性加成。（专注：1）"
LocHelpText="此灵能机械突击兵与另一单位进行心灵融合。融合存在期间，该单位获得属性加成。（专注：1）"
LocFlyOverText="神圣战士"
LocPromotionPopupText="<Bullet/> 此灵能机械突击兵与另一单位进行心灵融合。融合存在期间，该单位获得属性加成。<br/><Bullet/> 如果灵能机械突击兵在融合时被杀死，该单位将失去属性加成并被杀死。"


[MecSoulfirePassive X2AbilityTemplate]
LocFriendlyName="增幅系统"
LocLongDescription="灵能机械可以被装备灵能增幅器作为副武器，从而可以使用灵魂之火。"
LocHelpText="灵能机械可以被装备灵能增幅器作为副武器，从而可以使用灵魂之火。"
LocFlyOverText="增幅系统"
LocPromotionPopupText="<Bullet/> 灵能机械可以被装备灵能增幅器作为副武器，从而可以使用灵魂之火。<br/><Bullet/> 灵魂之火有<Ability:SelfCooldown/>回合的冷却时间。<br/><Bullet/> 通过升级灵能特工的灵能增幅器，可以增加灵魂之火能力的伤害。<br/><Bullet/> 机器人和机械敌人完全免疫灵魂之火。<br/>"


[MecSoulfire X2AbilityTemplate]
LocFriendlyName="灵魂之火协议"
LocLongDescription="对有机敌人造成稳定的灵能伤害。无视掩护和装甲。"
LocHelpText="对有机敌人造成稳定的灵能伤害。无视掩护和装甲。"
LocFlyOverText="灵魂之火协议"
LocPromotionPopupText="<Bullet/> 灵魂之火有<Ability:SelfCooldown/>回合的冷却时间。<br/><Bullet/> 通过升级灵能特工的灵能增幅器，可以增加灵魂之火能力的伤害。<br/><Bullet/> 机器人和机械敌人完全免疫灵魂之火。<br/>"

[MecVolt X2AbilityTemplate]
LocFriendlyName="伏特协议"
LocLongDescription="灵能攻击，造成低伤害，但在高专注等级下会跳跃到附近的单位。消耗1点专注。"
LocHelpText="灵能攻击，可以跳跃到附近的单位。消耗1点专注。"
LocPromotionPopupText="<Bullet/> 伏特没有冷却时间，但消耗1点专注。<br/><Bullet/> 伏特对灵能单位造成双倍伤害。<br/><Bullet/> 伏特可以跳跃到与当前专注等级相等数量的敌人。<br/>"

[MecIonicStorm X2AbilityTemplate]
LocFriendlyName="离子风暴协议"
LocLongDescription="召唤闪电攻击所有附近的敌人。伤害随专注等级增加。消耗所有专注，但击杀敌人会生成专注。"
LocHelpText="召唤闪电攻击所有附近的敌人。消耗所有专注，但击杀敌人会生成专注。"
LocPromotionPopupText="<Bullet/> 离子风暴的半径随专注等级增加而扩大。<br/><Bullet/> 离子风暴对灵能单位造成双倍伤害。<br/><Bullet/> 当离子风暴在高专注等级下能击杀多个目标时，立即返还消耗的专注。<br/><Bullet/> 离子风暴有<Ability:SelfCooldown/>回合的冷却时间。<br/>"


[MecNullLance X2AbilityTemplate]
LocFriendlyName="虚空长矛协议"
LocLongDescription="投射一束强大的光束，穿透并伤害沿途的每一个目标。此攻击可以穿透多个敌人和障碍物。"
LocHelpText="投射一束灵能力量光束，穿透并伤害沿途的每一个目标。"
LocFlyOverText="虚空长矛协议"
LocPromotionPopupText="<Bullet/> 虚空长矛有<Ability:SelfCooldown/>回合的冷却时间。<br/><Bullet/> 通过提高专注，可以增加虚空长矛的伤害。<br/>"

[GrieveProtocol X2AbilityTemplate]
LocFriendlyName="哀悼协议"
LocLongDescription="灵能机械突击兵在被敌人攻击时会恢复专注。"
LocHelpText="灵能机械突击兵在被敌人攻击时会恢复专注。"
LocFlyOverText="哀悼协议"
LocPromotionPopupText="<Bullet/> 灵能机械突击兵在被敌人攻击时会恢复专注。<br/><Bullet/> 通过与敌人主动接触，有机会恢复专注。<br/>"

[MecDimensionalRiftStage1 X2AbilityTemplate]
LocFriendlyName="维度裂隙"
LocLongDescription="PSI-MEC创造了一个汹涌的维度不稳定性，经过短暂延迟后爆发。任何被爆炸波及的受害者都会受到伤害，并可能因释放的非自然能量而被击晕或迷失方向。"
LocHelpText="打开一个大型灵能裂隙，伤害所有留在其边界内的单位。"
LocFlyOverText="维度裂隙"

[MecDimensionalRiftStage2 X2AbilityTemplate]
LocFriendlyName="维度裂隙"
LocLongDescription="PSI-MEC创造了一个汹涌的维度不稳定性，经过短暂延迟后爆发。任何被爆炸波及的受害者都会受到伤害，并可能因释放的非自然能量而被击晕或迷失方向。"
LocHelpText="打开一个大型灵能裂隙，伤害所有留在其边界内的单位。"
LocFlyOverText="维度裂隙"


[MecDimensionalRift X2AbilityTemplate]
LocFriendlyName="维度裂隙协议"
LocLongDescription="灵能MEC创造了一个汹涌的维度不稳定性，经过短暂延迟后爆发。任何被爆炸波及的受害者都会受到伤害，并可能因释放的非自然能量而被击晕或迷失方向。"
LocHelpText="打开一个大型灵能裂隙，伤害所有留在其边界内的单位。"
LocFlyOverText="维度裂隙"
LocPromotionPopupText="<Bullet/> 维度裂隙有<Ability:SelfCooldown/>回合的冷却时间。<br/>"


[SoulStealTriggered X2AbilityTemplate]
-LocPromotionPopupText=""
+LocPromotionPopupText="<Bullet/> 灵魂窃取只能补充失去的生命值，不能增加射手的最大生命值。<br/>"



[RM_PuellaMecTrooper X2SoldierClassTemplate]
DisplayName="精神机械突击兵"
ClassSummary="纯钢与灵魂的完美融合，精神机械突击兵擅长前线，以强力打击著称。"
LeftAbilityTreeTitle="圣殿骑士"
RightAbilityTreeTitle="修复者"

AbilityTreeTitles[0]="贤者"
AbilityTreeTitles[1]="心灵感应"
AbilityTreeTitles[2]="精神机械"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="猎手"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="密耳弥冬"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="军刀"
RandomNickNames[8]="狙击猎手"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="巨剑"
RandomNickNames[12]="细剑"
RandomNickNames[13]="流星锤"
RandomNickNames[14]="钉头锤"
RandomNickNames[15]="长矛"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="萨里沙长矛"
RandomNickNames[19]="正宗"
RandomNickNames[20]="石中剑"
RandomNickNames[21]="永恒之枪"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="短剑"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="千兆"
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="锈蚀桶"
RandomNickNames[32]="碾压者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="废品场"
RandomNickNames[35]="残骸"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="石巨人"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNickNames_Female[2]="铁娘子"
RandomNickNames_Female[3]="铁处女"
RandomNickNames_Female[4]="女盾战士"
RandomNickNames_Female[5]="女武神"
RandomNickNames_Female[6]="大姐姐"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，敌人的碎骨！"
PhotoboothSoloBLines_Male[1]="这家伙能装下很多拳头。"
PhotoboothSoloBLines_Male[2]="这台机械杀外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="强大的意志，他的拳头，他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，敌人的碎骨！"
PhotoboothSoloBLines_Female[1]="这姑娘能装下很多拳头。"
PhotoboothSoloBLines_Female[2]="这台机械杀外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="强大的意志，她的拳头，她能杀死的所有外星人。"


RankNames[0]="新兵"
RankNames[1]="侍从"
RankNames[2]="见习"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="冠军"
RankNames[8]="实体"

ShortNames[0]="新兵"
ShortNames[1]="侍从"
ShortNames[2]="见习"
ShortNames[3]="骑士"
ShortNames[4]="骑兵"
ShortNames[5]="先锋"
ShortNames[6]="圣骑士"
ShortNames[7]="冠军"
ShortNames[8]="实体"

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_PsiMecTrooper.rank_squire"
RankIcons[2]="UILibrary_PsiMecTrooper.rank_cavalier"
RankIcons[3]="UILibrary_PsiMecTrooper.rank_knight"
RankIcons[4]="UILibrary_PsiMecTrooper.rank_vanguard"
RankIcons[5]="UILibrary_PsiMecTrooper.rank_templar"
RankIcons[6]="UILibrary_PsiMecTrooper.rank_paladin"
RankIcons[7]="UILibrary_PsiMecTrooper.rank_champion"
RankIcons[8]="UILibrary_PsiMecTrooper.rank_fieldmarshall"